module EnglishPack
  SERVER_URL = 'http://dictionary.cambridge.org/dictionary/british/'
  NOT_FOUND_REGEX = /not\sfound/
  LABEL = 'en'

  ALPHABET = { 'A' => [6, 1],
               'B' => [4, 2],
               'C' => [4, 2],
               'D' => [4, 2],
               'E' => [4, 2],
               'F' => [4, 2],
               'G' => [4, 2],
               'H' => [4, 2],
               'I' => [4, 2],
               'J' => [4, 2],
               'K' => [4, 2],
               'L' => [4, 2],
               'M' => [4, 2],
               'N' => [4, 2],
               'O' => [4, 2],
               'P' => [4, 2],
               'Q' => [4, 2],
               'R' => [4, 2],
               'S' => [4, 2],
               'T' => [4, 2],
               'U' => [4, 2],
               'V' => [4, 2],
               'W' => [4, 2],
               'X' => [4, 2],
               'Y' => [4, 2],
               'Z' => [4, 2],
               '_' => [0, 0]
  }

  MAIN_REGEX = /[a-z]/i
  CMD_REGEX = /([1[0-5]|[1-9]],[1[0-5]|[1-9]])\s[vh]\s[a-z]+/i
end

module BulgarianPack
  SERVER_URL = 'http://rechnik.info/'
  NOT_FOUND_REGEX = /не\sе\sоткрита\sв\sречника/
  LABEL = 'bg'

  ALPHABET = { 'А' => [1, 17],
               'Б' => [2, 1],
               'В' => [2, 1],
               'Г' => [3, 1],
               'Д' => [2, 1],
               'Е' => [1, 1],
               'Ж' => [4, 1],
               'З' => [4, 1],
               'И' => [1, 1],
               'Й' => [5, 1],
               'К' => [2, 1],
               'Л' => [2, 1],
               'М' => [2, 1],
               'Н' => [1, 1],
               'О' => [1, 1],
               'П' => [1, 1],
               'Р' => [1, 1],
               'С' => [1, 1],
               'Т' => [1, 1],
               'У' => [5, 1],
               'Ф' => [10, 1],
               'Х' => [5, 4],
               'Ц' => [8, 1],
               'Ч' => [5, 4],
               'Ш' => [8, 4],
               'Щ' => [10, 2],
               'Ъ' => [3, 4],
               'Ь' => [10, 1],
               'Ю' => [8, 1],
               'Я' => [5, 4],
               '_' => [0, 0]
  }.freeze

  MAIN_REGEX = /\p{Cyrillic}/i
  CMD_REGEX = /([1[0-5]|[1-9]],[1[0-5]|[1-9]])\s[vh]\s[\p{Cyrillic}]+/i
end
