module EnglishPack
  SERVER_URL = 'http://dictionary.cambridge.org/dictionary/british/'
  NOT_FOUND_REGEX = /not\sfound/
  LABEL = 'en'

  ALPHABET = { 'a' => [6, 1],
               'b' => [4, 2],
               'c' => [4, 2],
               'd' => [4, 2],
               'e' => [4, 2],
               'f' => [4, 2],
               'g' => [4, 2],
               'h' => [4, 2],
               'i' => [4, 2],
               'j' => [4, 2],
               'k' => [4, 2],
               'l' => [4, 2],
               'm' => [4, 2],
               'n' => [4, 2],
               'o' => [4, 2],
               'p' => [4, 2],
               'q' => [4, 2],
               'r' => [4, 2],
               's' => [4, 2],
               't' => [4, 2],
               'u' => [4, 2],
               'v' => [4, 2],
               'w' => [4, 2],
               'x' => [4, 2],
               'y' => [4, 2],
               'z' => [4, 2],
               '_' => [0, 0]
  }

  MAIN_REGEX = /^[a-z]$/i
  CMD_REGEX = /(^(1[0-5]|[1-9]),(1[0-5]|[1-9])\s[vh]\s[a-z]+$/i
end

module BulgarianPack
  SERVER_URL = 'http://rechnik.info/'
  NOT_FOUND_REGEX = /не\sе\sоткрита\sв\sречника/
  LABEL = 'bg'

  ALPHABET = { 'а' => [1, 17],
               'б' => [2, 1],
               'в' => [2, 1],
               'г' => [3, 1],
               'д' => [2, 1],
               'е' => [1, 1],
               'ж' => [4, 1],
               'з' => [4, 1],
               'и' => [1, 1],
               'й' => [5, 1],
               'к' => [2, 1],
               'л' => [2, 1],
               'м' => [2, 1],
               'н' => [1, 1],
               'о' => [1, 1],
               'п' => [1, 1],
               'р' => [1, 1],
               'с' => [1, 1],
               'т' => [1, 1],
               'у' => [5, 1],
               'ф' => [10, 1],
               'х' => [5, 4],
               'ц' => [8, 1],
               'ч' => [5, 4],
               'ш' => [8, 4],
               'щ' => [10, 2],
               'ъ' => [3, 4],
               'ь' => [10, 1],
               'ю' => [8, 1],
               'я' => [5, 4],
               '_' => [0, 0]
  }.freeze

  MAIN_REGEX = /^\p{Cyrillic}$/i
  CMD_REGEX = /^(1[0-5]|[1-9]),(1[0-5]|[1-9])\s[vh]\s[\p{Cyrillic}]+$/i
end
